{
    "Senha": "Password",
    "Nome Completo": "FullName",
    "Email": "Email",
    "Configurações de Plataforma": "Platform Settings",
    "Informação do Perfil": "Profile Information",
    "Idioma": "Language",
    "Configurações de Movimentos": "Movement Settings",
    "Gerir Categorias": "Manage Categories",
    "Gerir Categorias de Movimentos": "Manage Movement Categories",
    "Categorias para Despesas": "Expense Categories",
    "Categorias para Receitas": "Income Categories",
    "Adicionar Categoria": "Add Category",
    "Selecionar o tipo de movimento": "Select the type of movement",
    "Despesa": "Expense",
    "Receita": "Income",
    "Adicionar": "Add",
    "Fechar": "Close",
    "Confirmar Password": "Confirm Password",
    "Passwords não coincidem": "Passwords do not match",
    "Passwords devem ter no mínimo": "Passwords must have at least",
    "caracteres": "characters",
    "Mudar idioma": "Change language",
    "Indica um nome para a categoria!": "Enter a name for the category!",
    "Adicionar Movimento": "Add Movement",
    "Adicione Categorias!": "Add Categories!",
    "Escreva uma categoria": "Write a category",
    "Nome": "Name",
    "Configurações": "Settings",
    "Personaliza a plataforma": "Customize the platform",
    "Cores da Barra Lateral": "Sidebar Colors",
    "Escura": "Dark",
    "Branca": "White",
    "Só podes alterar o tipo de Aba em vista desktop": "You can only change the Tab type in desktop view",
    "Modo Escuro": "Dark Mode",
    "Modo Claro": "Light Mode",
    "Escolhe entre 2 tipos": "Choose between 2 types",
    "Fundo da Aba de Navegação": "Navigation Tab Background",
    "Email não pode ser nulo": "Email cannot be null",
    "Nome não pode ser nulo": "Name cannot be null",
    "Insere o teu email e password para registar": "Enter your email and password to register",
    "Regista-te": "Register",
    "Nome não pode estar vazio": "Name cannot be empty",
    "Eu concordo com os ": "I agree with the ",
    "Termos e Condições": "Terms and Conditions",
    "Registar": "Register",
    "Já tens conta": "Already have an account",
    "Iniciar ": "Log",
    "Sessão": "In",
    "Ainda não tens conta": "Don't have an account yet",
    "Entrar": "Enter",
    "Password incorreta": "Incorrect password",
    "Estes Termos e Condições regem o uso deste Serviço fornecido pelo Grupo de Trabalho": "These Terms and Conditions govern the use of this Service provided by the Working Group",
    "Por favor, leia estes Termos cuidadosamente antes de utilizar o Serviço": "Please read these Terms carefully before using the Service",
    "Aceitação destes Termos": "Acceptance of these Terms",
    "Ao aceder ou ao usar o Serviço de qualquer forma, o utilizador concorda em ficar vinculado por estes Termos. Caso não concorde com qualquer parte dos Termos, o utilizador não está autorizado a utilizar o Serviço" : "By accessing or using the Service in any way, the user agrees to be bound by these Terms. If you do not agree with any part of the Terms, you are not authorized to use the Service",
    "Uso do Serviço": "Use of the Service",
    "O utilizador deve ter pelo menos 12 anos de idade para utilizar este Serviço": "The user must be at least 12 years old to use this Service",
    "O utilizador concorda em utilizar o Serviço apenas para fins legais e de acordo com estes Termos": "The user agrees to use the Service only for legal purposes and in accordance with these Terms",
    "Responsabilidades do Utilizador": "User Responsibilities",
    "O utilizador concorda em não fazer o seguinte": "The user agrees not to do the following",
    "Publicar, enviar por e-mail ou transmitir de outra forma qualquer conteúdo que seja ilegal, prejudicial, difamatório, abusivo, ameaçador, assediante, obsceno, vulgar, invasivo da privacidade de outra pessoa, odioso ou racialmente, etnicamente ou de outra forma ofensivo": "Post, email or otherwise transmit any content that is illegal, harmful, defamatory, abusive, threatening, harassing, obscene, vulgar, invasive of another person's privacy, hateful or racially, ethnically or otherwise offensive",
    "Praticar qualquer atividade que interfira ou interrompa a funcionalidade do Serviço ou de qualquer servidor ou rede conectada ao Serviço" : "Engage in any activity that interferes with or disrupts the functionality of the Service or any server or network connected to the Service",
    "Modificações nos Termos": "Changes to the Terms",
    "Reservamo-nos o direito, a nosso critério exclusivo, de modificar ou substituir estes Termos a qualquer momento. Se uma revisão fôr significativa, tentaremos fornecer um aviso com pelo menos cinco dias de antecedência antes que os novos termos entrem em vigor": "We reserve the right, at our sole discretion, to modify or replace these Terms at any time. If a revision is significant, we will try to provide notice at least five days in advance before the new terms take effect",
    "Contacto": "Contact",
    "Se tiver alguma dúvida sobre estes Termos, pode entrar em contato conosco através do e-mail": "If you have any questions about these Terms, you can contact us by email",
    "Estes Termos e Condições de Uso foram atualizados pela última vez a": "These Terms and Conditions of Use were last updated on",
    "17 de junho de 2024": "June 17, 2024",
    "Email não pode estar vazio": "Email cannot be empty",
    "Este email já está em uso": "This email is already in use",
    "Email inválido": "Invalid email",
    "Email incorreto": "Incorrect email",
    "Email não existe": "Email does not exist",
    "Editar": "Edit",
    "Guardar": "Save",
    "Voltar": "Back",
    "Nova": "New",
    "Terminar Sessão": "Sign Out",
    "Editar Perfil": "Edit Profile",
    "Alterar Password": "Change Password"
}

